{
  "description": "Hiking has a new look: the style of the Stinger GTX.<br><br>Designed for medium altitude hiking and fast trekking, the Stinger GTX is a lightweight, flexible and versatile shoe featuring an athletic and contemporary design.<br><br>The upper is both lightweight and hard-wearing. It’s made of mesh with stitching-free polyurethane panels: breathability and durability with a unique style.<br><br>The lining is in Gore-Tex Extended Comfort, a high-performance membrane famed for providing a range of outstanding properties. Providing breathability and waterproofness in perfect balance, it keeps your feet dry and protected, thanks to a system designed to provide maximum climatic comfort. The membrane is specifically designed for moderate or warm-weather conditions and for intense physical activities. In fact, the traditional insulating layer has been left out to guarantee minimum thermal retention.<br><br>This impenetrable barrier shrugs off summer downpours with ease: with Stinger GTX your foot stays drier for longer and your skin can breathe easily.<br><br>Stinger GTX is designed to be fully adaptable to your needs: its Smart Lacing System featuring integrated lace locks and external hooks provides super-fast adjustment: once you try it, you’ll wonder how you ever managed without it. The system allows you to create a comfortable fit straight from the box and provides easy, fast adjustment when you’re out on the hills. Your personalised lacing even stays dialled in after you take the shoes off.<br><br>A superior comfort fit is assured thanks to specific features: the exclusive Ankle Lock System ensures supportive and precise closure around the ankle whilst at the same time facilitating its natural movement. The resulting sensation is of a perfect symbiosis between your foot and the shoe. The soft padding around the ankle bone further enhances comfort and reinforces the structure without adding extra weight.<br><br>The lacing and tongue are asymmetrical to respect your foot’s natural shape and to provide a superbly snug fit that almost feels like a glove.<br><br>The outsole features the exclusive Vibram® Multiverse sole, specifically engineered for mixed terrain types even with heavy loads: the excellent midsole cushioning absorbs shocks and protects your joints. The lug pattern provides high performance during technical walk-ins as it ensures maximum grip on the heel and the full area at the toe to enhance safety when scrambling. The rubber toe cap further protects the foot on uneven ground.<br><br>A perfect blend of performance and style to give a new look to summer hiking.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/350543.jpg"
  ],
  "name": "Kayland - R.O.I. Recreation Outfitters Inc. Stinger GTX - Mens",
  "price_cents": null,
  "specs": [],
  "url": "https://vpo.ca/product/350543/stinger-gtx-mens"
}