{
  "description": "Eiger, Matterhorn, Grand Jorasses – peaks practically synonymous with the supreme discipline of mountaineering: north-facing ascents.Their Nordwand Pro jacket is designed specifically for that.&nbsp; A hardshell jacket for extreme alpine expeditions. \n<p>It took years of fine-tuning and countless design iterations to achieve the superior fit and features of the Nordwand Pro. And it shows – down to the last detail.</p>\n<p>The Mammut Pro Team athletes and the mountain guides from the Mammut Alpine School provided some of the best ideas. The athletes play an integral role in the further development of the jacket. The latest edition of the Nordwand Pro has been improved to offer some impressive advantages.</p>\n<p>Specific parts of the jacket are constructed with new Gore-Tex® PRO Stretch technology. Combined with the innovative cut, this greatly improves your level of comfort and ability to move while climbing.</p>\n<p>All other sections are made with new Gore-Tex® PRO Most Rugged technology to offer the ideal combination of weather protection and maximum durability. In the new edition,&nbsp;they reinforced the parts that get the most wear and the workmanship has been refined down to the last detail.</p>\n<p>The backing material is dope-dyed to reduce resource consumption. That means&nbsp;they use less water during production.</p>\n<p>A helmet-friendly hood with reinforced peak, underarm ventilation with a water-repellent two-way zipper and a removable snow skirt are just a few of the many tried and tested features.</p>\n<p>The Nordwand Pro is a premium, full-featured technical jacket that does it all and is designed for extra durability on technical alpine expeditions </p>",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/330754.jpg"
  ],
  "name": "Mammut Nordwand Pro HS Hooded Jacket - Mens",
  "price_cents": 10950000,
  "specs": [
    {
      "key": "Main Fabric 1",
      "value": "Gore-Tex® PRO 3-layer - 100% Polyamide 66"
    },
    {
      "key": "Main Fabric 2",
      "value": "Gore-Tex® PRO 3-layer - 90% Polyamide, 10% Polyurethane"
    },
    {
      "key": "Membrane",
      "value": "100% Polytetrafluorethylene"
    },
    {
      "key": "Backing",
      "value": "100% Polyamide 66"
    },
    {
      "key": "Weight",
      "value": "620 g"
    },
    {
      "key": "Water column",
      "value": "28000 mm"
    }
  ],
  "url": "https://vpo.ca/product/330754/nordwand-pro-hs-hooded-jacket-mens"
}