{
  "description": "Norrona's warmest, most durable waterproof ski/snowboard jacket.<br><br>This insulated heavy-duty jacket is made for powder runs in the backcountry but works excellent for general ski and snowboard activities.<br><br>The jacket is made in premium GORE-TEX® fabric. We use this because it is the world-leading membrane for durable waterproofness (28,000mm), optimized breathability, and total windproof ness. In addition, it's insulated with our thermo synthetic insulation, which offers excellent warmth-to-weight values, good packability, and insulation even when wet.<br><br>The main fabric is a 2-layer GORE-TEX® 70Dx160D (RET less than 9) with a 100% recycled nylon face fabric with a cotton like finish. As the jacket is insulated, we use 2-layers to make it softer and lighter without compromising on performance. It ensures durable, reliable weather protection perfect for deep powder days. In addition, we’ve added 2-layer 200D GORE-TEX® reinforcement on the shoulders and elbows to provide extra protection on these exposed areas.<br><br>It's insulated with a high-quality recycled polyester thermo filling distributed according to body mapping to pinpoint the proper insulation in the right place; The torso is 80g/m2, the hood 60g/m2, and the arms 40g/m2.<br><br>Key features include a helmet-compatible hood with one-hand adjustment, chest pocket, two zippered lower hand pockets with flaps, zippered sleeve pocket, underarm venting with mesh, one zippered inner pocket, an inside mesh pocket for larger items, a smooth fleece backer next-to-skin for soft comfort, one-hand hem adjustment, a detachable snow skirt and laminated hand gaiters.<br><br>The jacket has a slightly long, relaxed fit and feel with articulated arms and a longer cut in the back for extra protection, perfect for backcountry riding.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/354658.jpg"
  ],
  "name": "Norrona Tamok GTX Thermo80 Jacket - Mens",
  "price_cents": null,
  "specs": [],
  "url": "https://vpo.ca/product/354658/tamok-gtx-thermo80-jacket-mens"
}