{
  "description": "Adding all-conditions versatility to the best all-around mountain show we offer, the Rapid GTX offers nearly unlimited possibilities. This hybrid shoe is equally adept at ticking off trail miles, boulder hopping and scrambling moderate slabs. The all-synthetic upper is lightweight and protective, and is backed by a GORE-TEX® Invisible Fit lining for waterproof protection. <br><br>The dual-density EVA midsole delivers a ride more akin to a trail running shoe, but they have added a TPU arch insert for torsion control, and their Dynamic Protection System insert in the forefoot for increased protection, propulsion and edging capability. <br><br>The Vibram® outsole features high-friction Megagrip rubber, and an edging zone under the big toe for unbeatable friction and traction. Snow underfoot? Sloppy trails/ No problem - the Rapid GTX is the perfect choice for moving fast over mixed mountain terrain in variable conditions.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/346885.jpg"
  ],
  "name": "Scarpa Rapid GTX - Mens",
  "price_cents": 1832000,
  "specs": [
    {
      "key": "Upper",
      "value": "Mesh"
    },
    {
      "key": "Lining",
      "value": "GORE-TEX® Invisible Fit Technology"
    },
    {
      "key": "Insole",
      "value": "Ortholite® Strobel and Footbed"
    },
    {
      "key": "Midsole",
      "value": "3D EVA-CM - 6mm drop"
    },
    {
      "key": "Outsole",
      "value": "Vibram® Agility"
    },
    {
      "key": "Last",
      "value": "ARSA"
    },
    {
      "key": "Weight (per shoe)",
      "value": "320 g"
    },
    {
      "key": "Origin",
      "value": "Vietnam"
    },
    {
      "key": "Mesh &amp; PU Upper with GORE-TEX",
      "value": "Breathable mesh with overlays of thermally welded PU film backed by GORE-TEX® Invisible Fit for lightweight waterproof protections with outstanding fit and comfort"
    },
    {
      "key": "Toe Protection",
      "value": "Asymmetric toe protection with spray rubber reinforcement for durability"
    },
    {
      "key": "Dynamic Protection System (DPS)",
      "value": "DPS insert in ESS adds protection, propulsion and edging capabilities"
    },
    {
      "key": "Midsole",
      "value": "Dual-density compression molded EVA with a TIP arch insert for torsion control"
    },
    {
      "key": "Outsole",
      "value": "Vibram® outsole with Megagrip rubber compound and medial forefoot edging zone for increase traction and friction"
    }
  ],
  "url": "https://vpo.ca/product/346885/rapid-gtx-mens"
}