{
  "description": "Shan WP from Trezeta is a waterproof, thermally-insulated boot designed for use on snow which is snowshoe compatible. The boot boasts outstanding Multiproof characteristics, making it ideal for harsh weather and cold temperatures. A technical après-ski boot which is both lightweight and robust, offering excellent performance during the most demanding winter activities, even after a long day, such as hiking in cold temperatures or for professional use in a snowy mountain environment. Shan WP is totally waterproof: the upper in fabric with PU coating hugs the foot perfectly, and is treated with Trezeta's Water Stopper water-repellent technology, a three-layer membrane that protects the foot from snow and bad weather, while the internal mesh layer provides excellent breathability for outstanding climate comfort. Its thermally-insulating inner lining is ideal for keeping your feet warm during prolonged exposures to harsh climates, thanks to the Heat Saver technology combined with an anatomically padded fit that maximizes comfort. <br><br>The sole unit guarantees excellent traction and grip characteristics on snowy, uneven, muddy or icy terrain. In particular, the Vibram® Nuasi outsole compound, with its distinctive tread pattern, provides stability and cushioning further enhanced by the EVA midsole. There are many design details that characterize the athleisure design, such as the eye-catching white sole, the polyurethane coating superimposed on the upper that provides waterproofing and serves as a decorative element, and the reinforced toe that employs thicker material. To enhance the fit, the mid-cut ankle has been slightly lowered through the use of a comfortable and modern lycra collar, while other details and trim, such as the weave detailing on the lace loops, create a product with a high aesthetic impact.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/351071.jpg"
  ],
  "name": "Trezeta Shan WP - Mens",
  "price_cents": null,
  "specs": [],
  "url": "https://vpo.ca/product/351071/shan-wp-mens"
}