{
  "description": "Urban dweller or travel blogger spirit? Carefree travel, wherever you go! Zeta Mid WP is a lightweight and versatile lifestyle shoe to ensure you look your best whatever the occasion: at work, when travelling, out and about in town or a fun evening with friends. One pair of shoes for so many settings...seriously? Sure! The secret is in the quality materials we use, which provide a perfect blend of performance and style to deliver a multifunctional shoe: great-looking and always comfortable, they deliver outstanding walking pleasure whatever you’re doing. The waterproof suede upper protects the foot with a touch of elegance, and the side insert in breathable mesh and Trezeta Water Stopper membrane ensure excellent durability and waterproofing. A real stand-out feature is the Vibram® Ecostep sole featuring an eco-friendly compound, with 30% coming from material recycled from the manufacturing processes of the Vibram® soles. The result is a quality outsole which delivers all-day comfort for travelling, outdoors and everyday use. What’s more, it also facilitates the natural rolling action of the foot. What better way to feel connected to the earth than stepping out in a safe pair of shoes, knowing that you’ve also done your bit for the environment? Zeta Mid WP provides excellent ankle protection but with a contemporary style. Stylish touches round off the shoe: coloured eyelets which match the rand, the leather tongue and collar in contrasting colours, the eye-catching design of the side stitching, the stamped logo and the distinctive texture of the sole. The colour palette reflects the eclectic spirit of those who are at ease both on city sidewalks and backcountry trails: natural tones with a casual and eco-chic style that team perfectly with any outfit.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/356698.jpg"
  ],
  "name": "Trezeta Zeta Mid WP - Mens",
  "price_cents": null,
  "specs": [],
  "url": "https://vpo.ca/product/356698/zeta-mid-wp-mens"
}